syabyr/efr32_base/protocol/flex/rail/sample-apps/dutycycle/main.c
/***************************************************************************//**
 * @file
 * @brief This application allows the user to use Button 1 to switch between
 * modes (Duty Cycle, Master, Slave) and use Button 0 to transmit a packet
 * or blast packets using the RAIL library, where blast refers to a continuous
 * flow of packets. The current mode and application status is printed on the
 * LCD screen.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "rail.h"
#include "rail_types.h"

#include "em_chip.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "em_emu.h"
#include "em_core.h"

#include "sl_sleeptimer.h"
#include "bsp.h"
#include "gpiointerrupt.h"
#include "graphics.h"

#include "rail_config.h"

#include "hal_common.h"

// Display buffer size
#ifndef APP_DISPLAY_BUFFER_SIZE
#define APP_DISPLAY_BUFFER_SIZE 64
#endif

// Memory manager configuration
#define MAX_BUFFER_SIZE 256

// Minimum allowed size of the TX FIFO
#define RAIL_TX_FIFO_SIZE 64

// General application memory sizes
#define APP_MAX_PACKET_LENGTH (MAX_BUFFER_SIZE - 12) /* sizeof(RAIL_RxPacketInfo_t) == 12) */

// buttons
typedef struct ButtonArray{
  GPIO_Port_TypeDef   port;
  unsigned int        pin;
} ButtonArray_t;
static const ButtonArray_t buttonArray[BSP_NO_OF_BUTTONS] = BSP_GPIO_BUTTONARRAY_INIT;

// Error codes
typedef enum {
  INVALID_APP_STATE,
  FAILED_TO_SET_RADIO_CONFIG
} ErrorCode;

char *errorCodeString[] =
{
  "Invalid App State         ",
  "Failed to set radio config"
};

// App states
typedef enum {
  IDLE,              // idle state
  PREAMBLE_RX,       // received a preamble
  SYNC_RX,           // received a sync
  PACKET_RX,         // listening for a packet
  PACKET_TX,         // sending a packet
  MASTER_BLAST_TX,   // blasting packets in master mode
  SLAVE_BLAST_RX,    // receiving a blast of packets in slave mode
} AppState;

// App modes
typedef enum {
  DUTY_CYCLE_MODE,  // alternate consistently between RX and IDLE
  MASTER_MODE,      // stay IDLE and blast many packets when button0 is pressed
  SLAVE_MODE,       // sleep; wake up occasionally to intercept master blast
} AppMode;

char *appModeString[] =
{
  "Duty cycle        ",
  "Master            ",
  "Slave             "
};

// Function prototypes
void RAILCb_Generic(RAIL_Handle_t railHandle, RAIL_Events_t events);
void RAILCb_TimerExpired(RAIL_Handle_t railHandle);
static void lcdPrintError(int errorCode);
void gpioCallback(uint8_t pin);
static void serviceButtonPresses(void);
static void switchAppMode(AppMode mode);
static void switchDutyCycleAppState(void);
static void switchMasterAppState(void);
static void switchSlaveAppState(void);
static void updateDisplay(void);
void slaveTimerExpiredCallback(sl_sleeptimer_timer_handle_t *handle, void *data);

/******************************************************************************
 * App constants and variables
 *****************************************************************************/

AppMode appMode = DUTY_CYCLE_MODE;      // Start in duty cycle mode
AppState appState = IDLE;               // Start in receive mode
AppState previousAppState = IDLE;       // Tracks previous state
bool forceStateChange = true;           // call state change irrespective of previous state
int channel = 0;                        // the channel used by the application
bool button0Pressed = false;            // is button0 pressed?
bool button1Pressed = false;            // is button1 pressed?
int packetReceived = 0;                 // RX packets count
int packetTransmitted = 0;              // TX packets count
int receiveBuffer[MAX_BUFFER_SIZE];     // buffer used for packet reception

// Parameters used in the initialization of rail
RAIL_Handle_t railHandle = NULL;

static RAIL_Config_t railCfg = {
  .eventsCallback = &RAILCb_Generic,
};

// Application payload data sent OTA with each transmission
__ALIGNED(4) // EFR32XG22 needs 32-bit alignment
static uint8_t data[RAIL_TX_FIFO_SIZE] = {
  0x0F, 0x16, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66,
  0x77, 0x88, 0x99, 0xAA, 0xBB, 0xCC, 0xDD, 0xEE,
};

/******************************************************************************
 * Duty Cycle mode constants and variables
 *****************************************************************************/

#define DUTY_CYCLE_ON_TIME          1600   // time to stay on (us)
#define DUTY_CYCLE_OFF_TIME         3400   // time to stay off (us)
#define DUTY_CYCLE_PREAMBLE_ON_TIME 10000  // time to stay on after preamble received (us)

/******************************************************************************
 * Master mode constants and variables
 *****************************************************************************/

#define MASTER_BLAST_TX_SIZE    150    // blast consecutive packets
#define MASTER_ACK_WAITING_TIME 150000 // how long to wait for Ack (us)

int masterTxBlastId = 0;            // ID for a blast
int masterTxBlastAcksReceived = 0;  // ID for ack of a blast
int masterTxBlastPacketsCount = 0;  // count of packets sent in a blast

/******************************************************************************
 * Slave mode constants and variables
 *****************************************************************************/

#define SLAVE_ON_TIME         15    // time to stay on (ms)
#define SLAVE_OFF_TIME        2500  // time to stay off (ms)
#define SLAVE_BLAST_RX_DELAY  30    // keep waiting for blast to end (ms)

int slaveRxBlastId = 0;                   // blast ID of the blast received
int slaveRxBlastCount = 0;                // count of total blasts received
sl_sleeptimer_timer_handle_t slaveRtcId;  // RTC timer ID
bool slaveRtcRunning;                     // boolean for RTC status

