syabyr/efr32_base/protocol/flex/rail/sample-apps/dutycycle/main.c
/******************************************************************************
 * App main
 *****************************************************************************/
int main(void)
{
  // Initialize the chip
  CHIP_Init();

  // Initialize the system clocks and other HAL components
  halInit();

  // RTC Init -- for system timekeeping and other useful things
  sl_sleeptimer_init();

  CMU_ClockEnable(cmuClock_GPIO, true);

  // Initialize the BSP
  BSP_Init(BSP_INIT_BCC);

  // Enable the buttons on the board
  for (int i = 0; i < BSP_NO_OF_BUTTONS; i++) {
    GPIO_PinModeSet(buttonArray[i].port, buttonArray[i].pin, gpioModeInputPull, 1);
  }

  // Initialize the LCD display
  GRAPHICS_Init();

  // Button Interrupt Config
  GPIOINT_Init();
  GPIOINT_CallbackRegister(buttonArray[0].pin, gpioCallback);
  GPIOINT_CallbackRegister(buttonArray[1].pin, gpioCallback);
  GPIO_IntConfig(buttonArray[0].port, buttonArray[0].pin, false, true, true);
  GPIO_IntConfig(buttonArray[1].port, buttonArray[1].pin, false, true, true);

  // Initialize Radio
  railHandle = RAIL_Init(&railCfg, NULL);
  if (railHandle == NULL) {
    while (1) ;
  }
  RAIL_Idle(railHandle, RAIL_IDLE, true);
  RAIL_ConfigCal(railHandle, RAIL_CAL_ALL);

  // Set us to a valid channel for this config and force an update in the main
  // loop to restart whatever action was going on
  RAIL_ConfigChannels(railHandle, channelConfigs[0], NULL);

  // Configure RAIL callbacks with no appended info
  RAIL_ConfigEvents(railHandle,
                    RAIL_EVENTS_ALL,
                    (RAIL_EVENT_RX_PACKET_RECEIVED
                     | RAIL_EVENT_RX_PREAMBLE_DETECT
                     | RAIL_EVENT_RX_FRAME_ERROR
                     | RAIL_EVENT_RX_SYNC1_DETECT
                     | RAIL_EVENT_RX_ADDRESS_FILTERED
                     | RAIL_EVENT_RX_FIFO_OVERFLOW
                     | RAIL_EVENT_TX_PACKET_SENT
                     | RAIL_EVENT_TX_CHANNEL_BUSY
                     | RAIL_EVENT_TX_ABORTED
                     | RAIL_EVENT_TX_BLOCKED
                     | RAIL_EVENT_TX_UNDERFLOW));

  // Initialize the PA now that the HFXO is up and the timing is correct
  RAIL_TxPowerConfig_t txPowerConfig = {
#if HAL_PA_2P4_LOWPOWER
    .mode = RAIL_TX_POWER_MODE_2P4_LP,
#else
    .mode = RAIL_TX_POWER_MODE_2P4_HP,
#endif
    .voltage = BSP_PA_VOLTAGE,
    .rampTime = HAL_PA_RAMP,
  };
#if RAIL_FEAT_SUBGIG_RADIO
  if (channelConfigs[0]->configs[0].baseFrequency < 1000000000UL) {
    // Use the Sub-GHz PA if required
    txPowerConfig.mode = RAIL_TX_POWER_MODE_SUBGIG;
  }
#endif
  if (RAIL_ConfigTxPower(railHandle, &txPowerConfig) != RAIL_STATUS_NO_ERROR) {
    // Error: The PA could not be initialized due to an improper configuration.
    // Please ensure your configuration is valid for the selected part.
    while (1) ;
  }
  RAIL_SetTxPower(railHandle, HAL_PA_POWER);

  updateDisplay();

  while (1) {
    // process button press behavior
    serviceButtonPresses();

    // call appropriate switch function if
    // 1) app state has changed or
    // 2) force change is requested
    if (previousAppState != appState
        || forceStateChange) {
      forceStateChange = false;
      if (appMode == DUTY_CYCLE_MODE) {
        switchDutyCycleAppState();
      } else if (appMode == SLAVE_MODE) {
        switchSlaveAppState();
      } else if (appMode == MASTER_MODE) {
        switchMasterAppState();
      }
    }
  }
}

/******************************************************************************
 * App specific functions
 *****************************************************************************/
/**************************************************************************//**
 * @brief   A function for managing what is shown on the LCD display in an
 *          error state.
 *****************************************************************************/
static void lcdPrintError(int errorCode)
{
  char textBuf[APP_DISPLAY_BUFFER_SIZE];
  // Clear what's currently on screen
  GRAPHICS_Clear();
  // Add the demo output strings
  GRAPHICS_AppendString("RAIL Duty Cycle Demo");
  GRAPHICS_AppendString("");
  snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "ERROR: %d", errorCode);
  GRAPHICS_AppendString(textBuf);
  GRAPHICS_AppendString("");
  GRAPHICS_AppendString(errorCodeString[errorCode]);
  // Force a redraw
  GRAPHICS_Update();
}

/**************************************************************************//**
 * @brief   A callback to handle a button press on the WSTK
 *
 * @param[in] pin  The pin used to identify the button that has been pressed.
 *****************************************************************************/
void gpioCallback(uint8_t pin)
{
  // button press on 0 causes a transmit from any other state. When tx
  // is complete we'll go back into idle state.
  if (pin == buttonArray[0].pin) {
    button0Pressed = true;
  }
  // button 1 takes us into our next appState IF we are not
  // in a protected appState, like preparing to transmit or receive
  else if (pin == buttonArray[1].pin) {
    button1Pressed = true;
  }
}

/**************************************************************************//**
 * @brief  A function for handling button presses outside of interrupt
 *         context.
 *****************************************************************************/
static void serviceButtonPresses(void)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_CRITICAL(); // Disable interrupts so we can't be whacked while processing
  // button press on 0 causes a transmit from any other state. When tx
  // is complete we'll go back into our previous appState
  if (button0Pressed) {
    button0Pressed = false;
    if (appMode == DUTY_CYCLE_MODE
        && appState != PACKET_TX) {
      appState = PACKET_TX;
    } else if (appMode == MASTER_MODE
               && appState != MASTER_BLAST_TX) {
      masterTxBlastId++;
      appState = MASTER_BLAST_TX;
    } else if (appMode == SLAVE_MODE) {
      // not doing anything in slave mode.
    }
  }
  // button 1 takes us into our next appState IF we are not
  // in a protected appState, like preparing to transmit or receive
  else if (button1Pressed) {
    button1Pressed = false;
    // protect the transitional states and only switch if IDLE or PACKET_RX
    if (appState == PREAMBLE_RX
        || appState == SYNC_RX
        || appState == PACKET_TX
        || appState == MASTER_BLAST_TX
        || appState == SLAVE_BLAST_RX) {
      // oops nothing hapened we were busy, could print an error here
    } else if (appMode == DUTY_CYCLE_MODE) {
      switchAppMode(MASTER_MODE);
    } else if (appMode == MASTER_MODE) {
      switchAppMode(SLAVE_MODE);
    } else if (appMode == SLAVE_MODE) {
      switchAppMode(DUTY_CYCLE_MODE);
    } else {
      lcdPrintError(INVALID_APP_STATE);
      while (1) ; //should never get here
    }
  }
  CORE_EXIT_CRITICAL(); // Re-enable interrupts when we are done
}

/**************************************************************************//**
 * @brief   Function to switch application mode
 *****************************************************************************/
static void switchAppMode(AppMode mode)
{
  if (mode == SLAVE_MODE) {
    if (RAIL_IsTimerRunning(railHandle)) {
      RAIL_CancelTimer(railHandle);
    }
  }

  forceStateChange = true;
  appState = IDLE;
  appMode = mode;
  packetReceived = 0;
  slaveRxBlastId = 0;
  slaveRxBlastCount = 0;
  masterTxBlastId = 0;
  masterTxBlastAcksReceived = 0;
  masterTxBlastPacketsCount = 0;
  packetTransmitted = 0;

  updateDisplay();
}

/**************************************************************************//**
 * @brief   Function to switch application state in Duty Cycle mode
 *****************************************************************************/
static void switchDutyCycleAppState(void)
{
  previousAppState = appState;

  // cancel previous timer and set new delay below
  if (RAIL_IsTimerRunning(railHandle)) {
    RAIL_CancelTimer(railHandle);
  }

  switch (appState) {
    case IDLE:
      RAIL_SetTimer(railHandle,
                    DUTY_CYCLE_OFF_TIME,
                    RAIL_TIME_DELAY,
                    &RAILCb_TimerExpired);
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      EMU_EnterEM1();
      break;
    case PREAMBLE_RX:
      RAIL_SetTimer(railHandle,
                    DUTY_CYCLE_PREAMBLE_ON_TIME,
                    RAIL_TIME_DELAY,
                    &RAILCb_TimerExpired);
      break;
    case SYNC_RX:
      // do nothing.. just wait.
      break;
    case PACKET_RX:
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      RAIL_StartRx(railHandle, channel, NULL);
      RAIL_SetTimer(railHandle,
                    DUTY_CYCLE_ON_TIME,
                    RAIL_TIME_DELAY,
                    &RAILCb_TimerExpired);
      break;
    case PACKET_TX:
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      data[0] = 0;
      RAIL_SetTxFifo(railHandle, data, sizeof(data), sizeof(data));
      RAIL_StartTx(railHandle, channel, RAIL_TX_OPTIONS_DEFAULT, NULL);
      break;
    default:
    {
      lcdPrintError(INVALID_APP_STATE);
      while (1) ; //should never get here
    }
  }
}

/**************************************************************************//**
 * @brief   Function to switch application state in Master mode
 *****************************************************************************/
static void switchMasterAppState(void)
{
  previousAppState = appState;

