syabyr/efr32_base/protocol/flex/rail/sample-apps/dutycycle/main.c
  // cancel previous timer
  if (RAIL_IsTimerRunning(railHandle)) {
    RAIL_CancelTimer(railHandle);
  }

  switch (appState) {
    case IDLE:
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      break;
    case PACKET_RX:
      RAIL_SetTimer(railHandle,
                    MASTER_ACK_WAITING_TIME,
                    RAIL_TIME_DELAY,
                    &RAILCb_TimerExpired);
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      RAIL_StartRx(railHandle, channel, NULL);
      break;
    case MASTER_BLAST_TX:
      data[0] = masterTxBlastId;
      RAIL_SetTxFifo(railHandle, data, sizeof(data), sizeof(data));
      RAIL_StartTx(railHandle, channel, RAIL_TX_OPTIONS_DEFAULT, NULL);
      break;
    default:
    {
      lcdPrintError(INVALID_APP_STATE);
      while (1) ; //should never get here
    }
  }

  updateDisplay();
}

/**************************************************************************//**
 * @brief   Function to switch application state in Slave mode
 *****************************************************************************/
static void switchSlaveAppState(void)
{
  previousAppState = appState;

  switch (appState) {
    case IDLE:
      sl_sleeptimer_restart_timer(&slaveRtcId, SLAVE_OFF_TIME, slaveTimerExpiredCallback, NULL, 0u, 0u);
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      EMU_EnterEM2(true);
      break;
    case PACKET_RX:
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      RAIL_StartRx(railHandle, channel, NULL);
      sl_sleeptimer_restart_timer(&slaveRtcId, SLAVE_ON_TIME, slaveTimerExpiredCallback, NULL, 0u, 0u);
      break;
    case PACKET_TX:
      data[0] = slaveRxBlastId;
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      RAIL_SetTxFifo(railHandle, data, sizeof(data), sizeof(data));
      RAIL_StartTx(railHandle, channel, RAIL_TX_OPTIONS_DEFAULT, NULL);
      break;
    case SLAVE_BLAST_RX:
      RAIL_Idle(railHandle, RAIL_IDLE, true);
      RAIL_StartRx(railHandle, channel, NULL);
      sl_sleeptimer_restart_timer(&slaveRtcId, SLAVE_BLAST_RX_DELAY, slaveTimerExpiredCallback, NULL, 0u, 0u);
      break;
    default:
    {
      lcdPrintError(INVALID_APP_STATE);
      while (1) ; //should never get here
    }
  }

  updateDisplay();
}

/**************************************************************************//**
 * @brief   A function for managing what is shown on the LCD display under
 *          normal conditions.
 *****************************************************************************/
static void updateDisplay(void)
{
  char textBuf[APP_DISPLAY_BUFFER_SIZE];

  // Clear what's currently on screen
  GRAPHICS_Clear();

  // Add the demo output strings
  GRAPHICS_AppendString("RAIL Duty Cycle Demo");
  GRAPHICS_AppendString("");
  GRAPHICS_AppendString("----- Mode -----");
  GRAPHICS_AppendString(appModeString[appMode]);
  GRAPHICS_AppendString("");

  if (appMode == DUTY_CYCLE_MODE) {
    GRAPHICS_AppendString("----- RX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Packet Rx: %d", (int)packetReceived);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");
    GRAPHICS_AppendString("----- TX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Packet Tx: %d", (int)packetTransmitted);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");
  } else if (appMode == MASTER_MODE) {
    GRAPHICS_AppendString("----- RX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Blast Acks: %d", (int)masterTxBlastAcksReceived);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");
    GRAPHICS_AppendString("----- TX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Blast ID: %d", (int)masterTxBlastId);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");
  } else if (appMode == SLAVE_MODE) {
    GRAPHICS_AppendString("----- RX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Blast ID: %d", (int)slaveRxBlastId);
    GRAPHICS_AppendString(textBuf);
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Blasts Rx: %d", (int)slaveRxBlastCount);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");

    GRAPHICS_AppendString("----- TX -----");
    snprintf(textBuf, APP_DISPLAY_BUFFER_SIZE, "Acks Tx: %d", (int)packetTransmitted);
    GRAPHICS_AppendString(textBuf);
    GRAPHICS_AppendString("");
  }

  // Force a redraw
  GRAPHICS_Update();
}

/******************************************************************************
 * Callback Implementation
 *****************************************************************************/
void slaveTimerExpiredCallback(sl_sleeptimer_timer_handle_t *handle, void *data)
{
  switch (appState) {
    case IDLE:  // set to RX mode, if we were in IDLE
      appState = PACKET_RX;
      break;
    case PACKET_RX: // set to IDLE, if we were in RX mode
      appState = IDLE;
      break;
    case SLAVE_BLAST_RX: // blast RX finished, so wait a bit and then ACK
      sl_sleeptimer_delay_millisecond(2 * SLAVE_BLAST_RX_DELAY);
      appState = PACKET_TX;
      break;
    default:
    {
      lcdPrintError(INVALID_APP_STATE);
      while (1) ; //should never get here
    }
  }
}

void RAILCb_TimerExpired(RAIL_Handle_t railHandle)
{
  if (appMode == MASTER_MODE) {
    appState = IDLE;  // ACK not received, go back to IDLE
  } else if (appMode == DUTY_CYCLE_MODE) {
    switch (appState) {
      case IDLE:  // set to RX mode, if we were in IDLE
        appState = PACKET_RX;
        break;
      case PACKET_RX:   // set to IDLE, if we were in RX mode
      case PREAMBLE_RX: // set to IDLE, if we received a preamble but not sync
      case PACKET_TX:   // set to IDLE, if we were transmitting a packet
        appState = IDLE;
        break;
      default:
      {
        lcdPrintError(INVALID_APP_STATE);
        while (1) ; //should never get here
      }
    }
  }
}

void RAILCb_Generic(RAIL_Handle_t railHandle, RAIL_Events_t events)
{
  // TX Radio Errors
  if (events & (RAIL_EVENT_TX_CHANNEL_BUSY
                | RAIL_EVENT_TX_ABORTED
                | RAIL_EVENT_TX_BLOCKED
                | RAIL_EVENT_TX_UNDERFLOW)) {
    if (appMode == MASTER_MODE) {
      if (masterTxBlastPacketsCount < MASTER_BLAST_TX_SIZE) {
        // blast going on
        appState = MASTER_BLAST_TX;
      }
    } else {
      // set to IDLE
      if (events & (RAIL_EVENT_TX_UNDERFLOW
                    | RAIL_EVENT_TX_CHANNEL_BUSY)) {
        appState = IDLE;
      }
    }
  }
  // Successful packet TX
  if (events & RAIL_EVENT_TX_PACKET_SENT) {
    if (appMode == DUTY_CYCLE_MODE) {
      // packet sent, go back to IDLE
      packetTransmitted++;
      appState = IDLE;
      updateDisplay();
    } else if (appMode == MASTER_MODE) {
      if (masterTxBlastPacketsCount < MASTER_BLAST_TX_SIZE) {
        // blast going on
        masterTxBlastPacketsCount++;
        appState = MASTER_BLAST_TX;
        forceStateChange = true;
      } else {
        // blast finished
        masterTxBlastPacketsCount = 0;
        appState = PACKET_RX;
      }
    } else if (appMode == SLAVE_MODE) {
      // ACK sent
      packetTransmitted++;
      slaveRxBlastCount++;
      appState = IDLE;
    }
  }
  // RX transition events
  if (events & (RAIL_EVENT_RX_PREAMBLE_DETECT
                | RAIL_EVENT_RX_SYNC1_DETECT
                | RAIL_EVENT_RX_FRAME_ERROR
                | RAIL_EVENT_RX_FIFO_OVERFLOW
                | RAIL_EVENT_RX_ADDRESS_FILTERED)) {
    if (appMode == DUTY_CYCLE_MODE) {
      // if preamble detected, continue listening for sync
      if (events & RAIL_EVENT_RX_PREAMBLE_DETECT) {
        forceStateChange = true;
        appState = PREAMBLE_RX;
      }

      // if Sync received, continue listening for packet
      if (events & RAIL_EVENT_RX_SYNC1_DETECT) {
        appState = SYNC_RX;
      }

      // if failed, switch back to idle
      if (events & (RAIL_EVENT_RX_FRAME_ERROR
                    | RAIL_EVENT_RX_FIFO_OVERFLOW
                    | RAIL_EVENT_RX_ADDRESS_FILTERED)) {
        appState = IDLE;
      }
    } else if (appMode == MASTER_MODE) {
      // ACK failed, set back to IDLE
      if (events & (RAIL_EVENT_RX_FRAME_ERROR
                    | RAIL_EVENT_RX_FIFO_OVERFLOW
                    | RAIL_EVENT_RX_ADDRESS_FILTERED)) {
        appState = IDLE;
      }
    } else if (appMode == SLAVE_MODE) {
      // continue listening for more packets in blast
      sl_sleeptimer_stop_timer(&slaveRtcId);
      appState = SLAVE_BLAST_RX;
      forceStateChange = true;
    }
  }
  // Successful packet RX
  if (events & RAIL_EVENT_RX_PACKET_RECEIVED) {
    RAIL_RxPacketInfo_t packetInfo;
    RAIL_GetRxPacketInfo(railHandle,
                         RAIL_RX_PACKET_HANDLE_NEWEST,
                         &packetInfo);

    if ((packetInfo.packetStatus != RAIL_RX_PACKET_READY_SUCCESS)
        && (packetInfo.packetStatus != RAIL_RX_PACKET_READY_CRC_ERROR)) {
      // RAIL_EVENT_RX_PACKET_RECEIVED must be handled last in order to return
      // early on aborted packets here.
      return;
    }

    if (appMode == DUTY_CYCLE_MODE) {
      // set back to idle and update display
      packetReceived++;
      appState = IDLE;
      updateDisplay();
    } else if (appMode == MASTER_MODE) {
      // increment ACK counter
      if (masterTxBlastId == packetInfo.firstPortionData[0]) {
        masterTxBlastAcksReceived++;
      }
      appState = IDLE;
    } else if (appMode == SLAVE_MODE) {
      // save the blast ID and wait for blast to end
      // after that, we will send the ACK
      if (slaveRxBlastId != packetInfo.firstPortionData[0]) {
        slaveRxBlastId = packetInfo.firstPortionData[0];
      }
      sl_sleeptimer_stop_timer(&slaveRtcId);
      appState = SLAVE_BLAST_RX;
      forceStateChange = true;
    }
  }
}
